import React from 'react';

const HomePage = () => {
    return (
        <div>
            <h2> Home Task</h2>
            <p>отримати пости та вивести їх використовуючи класові копмоненти
                отримати коментарі та вивести їх використовуючи класові копмоненти

                Використовуючи хук useReducer в якому початковый стейт буде cats: [], dogs:[]
                Реалізвути збереження окремо нового кота, та окремо собаку (приклад на зображенні)

                Advance
                реалізувати видалення для кожного при натисканні на кнопку delete</p>
        </div>
    );
};

export default HomePage;